#ifndef __XINLV_H
#define __XINLV_H
#define XINLV_START_STATE     0   /* 0：禁用文件 1：使能文件 */
#if XINLV_START_STATE
/* ***************************头文件引入 开始******************************* */
#include "sys.h"
#include "adcx.h"
#include "stdbool.h"
/* ***************************头文件引入 结束******************************* */

/* ***************************宏定义 开始*********************************** */
/* 注意：本文件使用ADC2 TIM3作为触发源触发ADC2开启采样 可以修改引脚 不可修改ADC2和TIM3 */
#define XINLV_CLK_ENABLE    RCC_APB2Periph_GPIOB
#define XINLV_PORT          GPIOB
#define XINLV_GPIO_PIN      GPIO_Pin_0
#define XINLV_ADC_CHANNEL   ADC_Channel_8

/* ***************************宏定义 结束*********************************** */

/* ***************************枚举类型定义 开始***************************** */

/* ***************************枚举类型定义 结束***************************** */

/* ***************************共用体类型定义 开始*************************** */

/* ***************************共用体类型定义 结束*************************** */

/* ***************************结构体类型定义 开始*************************** */

/* ***************************结构体类型定义 结束*************************** */

/* ***************************外部变量声明 开始***************************** */

/* ***************************外部变量声明 结束***************************** */

/* ***************************函数接口声明 开始***************************** */
void XINLV_Init(void);
int XINLV_GetValue(void);   /* 返回心率值 */
/* ***************************函数接口声明 结束***************************** */

#endif

#endif
