#ifndef __ACTION_TASK_H
#define __ACTION_TASK_H

/* ***************************头文件引入 开始******************************* */
#include "main.h"
#include "Task.h"
/* ***************************头文件引入 结束******************************* */

/* ***************************宏定义 开始*********************************** */
#define MENU_PAGE_NUM       3   /* 菜单页数，不含首页 */
#define MENU_UPDATE_SPACE   100 /* OLED刷新间隔单位ms 最小值为1 */
#define DEVICE_AUTO_MODE    0   /* 自动模式 */
#define DEVICE_HAND_MODE    1   /* 手动模式 */
/* ***************************宏定义 结束*********************************** */

/* ***************************枚举类型定义 开始***************************** */
typedef enum
{
    MENU_MAIN_PAGE = 0,     /* 菜单页首页 */
    MENU_PAGE_ONE = 1,      /* 菜单页第一页 */
    MENU_PAGE_TWO = 2,      /* 菜单页第二页 */
    MENU_PAGE_THREE = 3,    /* 菜单页第三页 */
}Memu_Items;
/* ***************************枚举类型定义 结束***************************** */

/* ***************************共用体类型定义 开始*************************** */

/* ***************************共用体类型定义 结束*************************** */

/* ***************************结构体类型定义 开始*************************** */
typedef struct
{
    uint32_t Run_TimeStamp;     /* 当前程序执行时间 */
    uint8_t Key_Value;          /* 按键扫描键值 */
    uint8_t Menu_Page;          /* 指示当前菜单页 */
}Action_Operations;

/* ***************************结构体类型定义 结束*************************** */

/* ***************************外部变量声明 开始***************************** */
extern Action_Operations Action_Ctrl;
/* ***************************外部变量声明 结束***************************** */

/* ***************************函数接口声明 开始***************************** */
void Action_Execute(void);
/* ***************************函数接口声明 结束***************************** */

#endif
