#ifndef __TASK_H
#define __TASK_H

/* ***************************头文件引入 开始******************************* */
#include "main.h"
#include "Comm_Task.h"
#include "Extern_Task.h"
#include "Sensor_Task.h"
#include "Actuator_Task.h"
#include <stdbool.h>
/* ***************************头文件引入 结束******************************* */

/* ***************************宏定义 开始*********************************** */

/* ***************************宏定义 结束*********************************** */

/* ***************************枚举类型定义 开始***************************** */

/* ***************************枚举类型定义 结束***************************** */

/* ***************************共用体类型定义 开始*************************** */

/* ***************************共用体类型定义 结束*************************** */

/* ***************************结构体类型定义 开始*************************** */
typedef struct
{
    bool eventStatus;       /* 事件状态 */
    uint32_t eventSpace;    /* 事件间隔 */
}
Event;                      /* 事件结构体 */
/* 任务控制器 */
typedef struct
{
    uint32_t    time_cnt;
    Event       Sensor_Task;    /* 传感器数据获取任务 */
    Event       Actuator_Task;  /* 执行器动作任务 */
    Event       Comm_Task;      /* 通信任务 */
    Event       Extern_Task;    /* 扩展任务 */
    Event       Action_Task;    /* 动作任务 */
}
TaskScheduler;
/* ***************************结构体类型定义 结束*************************** */

/* ***************************外部变量声明 开始***************************** */
extern TaskScheduler taskScheduler;
/* ***************************外部变量声明 结束***************************** */

/* ***************************函数接口声明 开始***************************** */
void Task_Init(void);       /* 任务调度初始化 */
void Task_Scheduler(void);  /* 任务调度器执行函数 */
/* ***************************函数接口声明 结束***************************** */

#endif
